openwch/ch32m030/EVT/EXAM/SRC/Peripheral/src/ch32m030_flash.c
    return status;
}

/*********************************************************************
 * @fn      FLASH_ROM_WRITE
 *
 * @brief   Writes a specified FLASH .
 *
 * @param   StartAddr - Writes Flash start address(StartAddr%128 == 0).
 *          Length - Writes Flash start Length(Length%128 == 0).
 *          pbuf - Writes Flash value buffer.
 *
 * @return  FLASH Status - The returned value can be: FLASH_ADR_RANGE_ERROR,
 *        FLASH_ALIGN_ERROR, FLASH_OP_RANGE_ERROR or FLASH_COMPLETE.
 */
FLASH_Status FLASH_ROM_WRITE( uint32_t StartAddr, uint32_t *pbuf, uint32_t Length )
{
    uint32_t i, adr;
    uint8_t size;

    FLASH_Status status = FLASH_COMPLETE;

    if((StartAddr < ValidAddrStart) || (StartAddr >= ValidAddrEnd))
    {
        return FLASH_ADR_RANGE_ERROR;
    }

    if((StartAddr + Length) > ValidAddrEnd)
    {
        return FLASH_OP_RANGE_ERROR;
    }

    if((StartAddr & (Size_128B-1)) || (Length & (Size_128B-1)) || (Length == 0))
    {
        return FLASH_ALIGN_ERROR;
    }
    adr = StartAddr;
    i = Length >> 7;

    /* Authorize the FPEC of Bank1 Access */
    FLASH->KEYR = FLASH_KEY1;
    FLASH->KEYR = FLASH_KEY2;

    /* Fast program mode unlock */
    FLASH->MODEKEYR = FLASH_KEY1;
    FLASH->MODEKEYR = FLASH_KEY2;

    do{
        FLASH->CTLR |= CR_PAGE_PG;
        FLASH->CTLR |= CR_BUF_RST;
        while(FLASH->STATR & SR_BSY)
            ;
        size = 16;
        while(size)
        {
            *(__IO uint32_t *)(StartAddr) = *(uint32_t *)pbuf++;
            *(__IO uint32_t *)(StartAddr + 0x04) = *(uint32_t *)pbuf++;
            FLASH->CTLR |= CR_BUF_LOAD;
            while(FLASH->STATR & SR_BSY)
                ;
            *(__IO uint32_t*)0x40022034 = *(__IO uint32_t*)((StartAddr & 0xFFFFFFFC) ^ 0x00000100);
            StartAddr += 8;
            size -= 1;
        }

        FLASH->ADDR = adr;
        FLASH->CTLR |= CR_STRT_Set;
        while(FLASH->STATR & SR_BSY)
            ;
        FLASH->CTLR &= ~CR_PAGE_PG;
        *(__IO uint32_t*)0x40022034 = *(__IO uint32_t*)((adr & 0xFFFFFFFC) ^ 0x00000100);
        adr += 128;
    }while(--i);

    FLASH->CTLR |= CR_FLOCK_Set;
    FLASH->CTLR |= CR_LOCK_Set;

    return status;
}

/*********************************************************************
 * @fn      FLASH_ECCERR_ITCmd
 *
 * @brief   Enables or disables the ECC error interrupts function.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void FLASH_ECCERR_ITCmd(FunctionalState NewState)
{
    if(NewState)
    {
        FLASH->CTLR |= (1<<20);
    }
    else
    {
        RCC->CTLR &= ~(1<<20);
    }
}

/*********************************************************************
 * @fn      FLASH_ECCERR_Recovery_SetErrFlagCmd
 *
 * @brief   Enables or disables  ECC error flag is set after the ECC error recovery.
 *
 * @param   NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void FLASH_ECCERR_Recovery_SetErrFlagCmd(FunctionalState NewState)
{
    if(NewState)
    {
        FLASH->CTLR |= (1<<21);
    }
    else
    {
        RCC->CTLR &= ~(1<<21);
    }
}

/*********************************************************************
 * @fn      FLASH_GetECCFlagStatus
 *
 * @brief   Checks whether the specified FLASH ECC flag is set or not.
 *
 * @param   FLASH_ECC_FLAG - specifies the FLASH ECC flag to check.
 *            FLASH_FLAG_ECC_CKEFail_RECFail - FLASH ECC error check fail
 *          and error recovery fail flag
 *            FLASH_FLAG_ECC_CKEFail_RECSuc - FLASH ECC error check fail
 *          and error recovery success flag
 *            FLASH_FLAG_ECC_CKESuc - FLASH ECC error check success flag
 *            FLASH_FLAG_ECC_CKEFail - FLASH ECC error check fail flag
 *
 * @return  The new state of FLASH_FLAG (SET or RESET).
 */
FlagStatus FLASH_GetECCFlagStatus(uint32_t FLASH_ECC_FLAG)
{
    FlagStatus bitstatus = RESET;

    if((FLASH->STATR & FLASH_ECC_FLAG) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*********************************************************************
 * @fn      FLASH_ClearECCFlag
 *
 * @brief   Clears the FLASH's ECC pending flags.
 *
 * @param   FLASH_ECC_FLAG - specifies the FLASH ECC flags to clear.
 *            FLASH_FLAG_ECC_CKEFail - FLASH ECC error check fail flag.
 *
 * @return  none
 */
void FLASH_ClearECCFlag(uint32_t FLASH_ECC_FLAG)
{
    FLASH->STATR = FLASH_ECC_FLAG;
}
